

uchar xdata stmp1[]="-10.0℃";
uchar xdata stmp2[]="-10.0℃";
uchar xdata shum[]="20%";
uchar xdata sA[]="20.0A"; 
uchar xdata sB[]="20.0A";
uchar xdata sC[]="20.0A";

uchar xdata yjztV=0,hsztV=0,fjztV=0,jsztV=0,qsztV=0;
uchar code* code yjzt[]={"压机停","压机延时","压机开"};
uchar code* code hszt[]={"化霜停","化霜滴水","化霜开"};
uchar code* code fjzt[]={"风机停","风机延时","风机开"};
uchar code* code jszt[]={"加湿停","加湿开"}; 
uchar code* code qszt[]={"除湿停","除湿开"};

/*uchar code* code rtscod[]= {	"101011","101021","102011","103011","103021","103031"
																"S01010","S01020","S01030","S01040","S01050"};	*/
uchar code* code name[]={	"冷库温度","化霜温度","冷库湿度","A相电流","B相电流","C相电流",
													"压机状态","化霜状态","风机状态","加湿状态","除湿状态"};

//报警网络代码
uchar code* code netwarn[]={	"W01011","W01021","W01031","W01041","W01051","W01063",
															"W01073","W01084","W01094","W01102","W01112","W01121",
															"W01131","W01141","W01151","W01161","W01171","W01181",
														}; 
uchar xdata netwid[sizeof(netwarn)/2];

//短信报警汉字内容
uchar code* code warn[]={ "库温超高",
													"库温超低",
													"库温探头开路",
													"库温探头短路",
													"化霜温度超高",
													"化霜探头开路",
													"化霜探头短路",
													"湿度探头开路",
													"温度探头短路",
													"湿度超高",
													"湿度超低",	
													"压机过载",
													"压机缺相",
													"电源断相",
													"电源错相",
													"压机不开机",
													"压机不停机",		 
													"外部报警",
													}; 
uchar xdata smswid=0; //for SMS warn


/* 	"00100101" 打开控制器；			"00100102" 关闭控制器；			"00100103,..." 修改控制器参数
		"00100201" 请求实时数据包；	"00100202" 请求控制参数包；	"00100110" 请求时钟数据(互相请求)  */
uchar code* code reverse[]={ 	"00100101",	"00100102",	"00100103",
															"00100201",	"00100202",	"00100110"
														};